[
  {
    "Id": "1",
    "Star": "Domhnall Gleeson, Rachel McAdams",
    "img": "https://upload.wikimedia.org/wikipedia/en/7/7c/About_Time_%282013_film%29_Poster.jpg",
    "Url": "https://www.youtube.com/embed/khB_wpn-bmc",
    "Title": "About Time",
    "Description": "About Time is a 2013 British romantic comedy-drama film written and directed by Richard Curtis, and starring Domhnall Gleeson, Rachel McAdams and Bill Nighy. The film is about a young man with the ability to time travel who tries to change his past in hopes of improving his future. The film was released in the United Kingdom on 4 September 2013. The film received mixed reviews from critics. The review aggregation website Rotten Tomatoes gives the film a rating of 70%, based on 154 reviews, with an average rating of 6.36/10. At the box office, it grossed $87.1 million against a $12 million budget.",
    "Ratings": null
  },
  {
    "Id": "2",
    "Star": "Will Smith, Mena Massoud, Naomi Scott",
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9a/Aladdin_%28Official_2019_Film_Poster%29.png",
    "Url": "https://www.youtube.com/embed/foyufD52aog",
    "Title": "Aladdin",
    "Description": "Aladdin is a 2019 American musical fantasy film produced by Walt Disney Pictures. Directed by Guy Ritchie, who co-wrote the screenplay with John August, it is a live-action adaptation of Disney\u0027s 1992 animated film of the same name, which itself is based on the eponymous tale from One Thousand and One Nights. The film stars Will Smith, Mena Massoud, Naomi Scott, Marwan Kenzari, Navid Negahban, Nasim Pedrad, Billy Magnussen, and Numan Acar, as well as the voices of Alan Tudyk and Frank Welker. The plot follows Aladdin, a street urchin, as he falls in love with Princess Jasmine, befriends a wish-granting Genie, and battles the wicked Jafar.",
    "Ratings": [
      5,
      5,
      2,
      3,
      1,
      4,
      5,
      4,
      4,
      2,
      5,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      5
    ]
  },
  {
    "Id": "3",
    "Star": "Rosa Salazar, Christoph Waltz, Jennifer Connelly, Mahershala Ali",
    "img": "https://upload.wikimedia.org/wikipedia/en/e/ee/Alita_Battle_Angel_%282019_poster%29.png",
    "Url": "https://www.youtube.com/embed/w7pYhpJaJW8",
    "Title": "Alita: Battle Angel",
    "Description": "Alita: Battle Angel is a 2019 American cyberpunk action film based on Japanese manga artist Yukito Kishiro\u0027s 1990s series Gunnm and its 1993 original video animation adaptation Battle Angel. It was directed by Robert Rodriguez and produced by James Cameron, who co-wrote the script with Laeta Kalogridis. Rosa Salazar stars through performance-capture animation as the titular heroine Alita, a cyborg who awakens in a new body with no memory of her past, so she sets out to uncover her destiny. Christoph Waltz, Jennifer Connelly, Mahershala Ali, Ed Skrein, Jackie Earle Haley, and Keean Johnson star in supporting roles.",
    "Ratings": [
      5
    ]
  },
  {
    "Id": "4",
    "Star": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson",
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Avengers_Endgame_poster.jpg",
    "Url": "https://www.youtube.com/embed/TcMBFSGVi1c",
    "Title": "Avengers: Endgame",
    "Description": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2012\u0027s The Avengers, 2015\u0027s Avengers: Age of Ultron, and 2018\u0027s Avengers: Infinity War, and the twenty-second film in the Marvel Cinematic Universe (MCU). It was directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, and features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse the damage caused by Thanos in Infinity War.",
    "Ratings": null
  },
  {
    "Id": "5",
    "Star": "Rami Malek, Lucy Boynton",
    "img": "https://upload.wikimedia.org/wikipedia/en/2/2e/Bohemian_Rhapsody_poster.png",
    "Url": "https://www.youtube.com/embed/mP0VHJYFOAU",
    "Title": "Bohemian Rhapsody",
    "Description": "Bohemian Rhapsody is a 2018 biographical drama film about Freddie Mercury, the lead singer of the British rock band Queen. It was directed by Bryan Singer from a screenplay by Anthony McCarten, and produced by Graham King and Queen manager Jim Beach. It stars Rami Malek as Mercury, with Lucy Boynton, Gwilym Lee, Ben Hardy, Joe Mazzello, Aidan Gillen, Tom Hollander, Allen Leech, and Mike Myers in supporting roles. Queen members Brian May and Roger Taylor served as consultants. A British-American venture, the film was produced by 20th Century Fox, Regency Enterprises, GK Films, and Queen Films, with Fox serving as distributor. The film follows the singer\u0027s life from the formation of the band up to their 1985 Live Aid performance at the original Wembley Stadium.",
    "Ratings": null
  },
  {
    "Id": "6",
    "Star": "Ewan McGregor, Hayley Atwell, Jim Cummings",
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a9/Christopher_Robin_poster.png",
    "Url": "https://www.youtube.com/embed/0URpDxIjZrQ",
    "Title": "Christopher Robin",
    "Description": "Christopher Robin is a 2018 American fantasy comedy-drama film directed by Marc Forster and written by Alex Ross Perry, Tom McCarthy, and Allison Schroeder, from a story by Greg Brooker and Mark Steven Johnson. The film is inspired by A. A. Milne and E. H. Shepard\u0027s Winnie-the-Pooh books[6] and is a live-action/CGI follow-up of the Disney franchise of the same name. The film stars Ewan McGregor as the title character, alongside Hayley Atwell and the voices of Jim Cummings, Brad Garrett, Nick Mohammed, Peter Capaldi, Sophie Okonedo, Sara Sheen, and Toby Jones. The story follows an adult Christopher Robin as he loses his sense of imagination, only to be reunited with his old stuffed bear friend, Winnie-the-Pooh.",
    "Ratings": null
  },
  {
    "Id": "7",
    "Star": "Russell Crowe, Joaquin Phoenix, Connie Nielsen",
    "img": "https://upload.wikimedia.org/wikipedia/en/f/fb/Gladiator_%282000_film_poster%29.png",
    "Url": "https://www.youtube.com/embed/owK1qxDselE",
    "Title": "Gladiator",
    "Description": "Gladiator is a 2000 epic historical drama film directed by Ridley Scott and written by David Franzoni, John Logan, and William Nicholson. The film was co-produced and released by DreamWorks Pictures and Universal Pictures. It stars Russell Crowe, Joaquin Phoenix, Connie Nielsen, Ralf Möller, Oliver Reed (in his final role), Djimon Hounsou, Derek Jacobi, John Shrapnel and Richard Harris. Crowe portrays Roman general Maximus Decimus Meridius, who is betrayed when Commodus, the ambitious son of Emperor Marcus Aurelius, murders his father and seizes the throne. Reduced to slavery, Maximus rises through the ranks of the gladiatorial arena to avenge the murders of his family and his emperor.",
    "Ratings": [
      3,
      4,
      2,
      5,
      1,
      4,
      5,
      2,
      3,
      4
    ]
  },
  {
    "Id": "8",
    "Star": "Clark Gable, Vivien Leigh, Leslie Howard",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Poster_-_Gone_With_the_Wind_01.jpg/330px-Poster_-_Gone_With_the_Wind_01.jpg",
    "Url": "https://www.youtube.com/embed/0X94oZgJis4",
    "Title": "Gone with the Wind",
    "Description": "Gone with the Wind is a 1939 American epic historical romance film adapted from the 1936 novel by Margaret Mitchell. The film was produced by David O. Selznick of Selznick International Pictures and directed by Victor Fleming. Set in the American South against the backdrop of the American Civil War and the Reconstruction era, the film tells the story of Scarlett O\u0027Hara, the strong-willed daughter of a Georgia plantation owner. It follows her romantic pursuit of Ashley Wilkes, who is married to his cousin, Melanie Hamilton, and her subsequent marriage to Rhett Butler. The leading roles are played by Vivien Leigh (Scarlett), Clark Gable (Rhett), Leslie Howard (Ashley), and Olivia de Havilland (Melanie).",
    "Ratings": null
  },
  {
    "Id": "9",
    "Star": "Andrew Garfield, Sam Worthington, Luke Bracey",
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8a/Hacksaw_Ridge_poster.png",
    "Url": "https://www.youtube.com/embed/s2-1hz1juBI",
    "Title": "Hacksaw Ridge",
    "Description": "Hacksaw Ridge is a 2016 biographical war drama film directed by Mel Gibson and written by Andrew Knight and Robert Schenkkan, based on the 2004 documentary The Conscientious Objector. The film focuses on the World War II experiences of Desmond Doss, an American pacifist combat medic who, as a Seventh-day Adventist Christian, refused to carry or use a weapon or firearm of any kind. Doss became the first conscientious objector to be awarded the Medal of Honor, for service above and beyond the call of duty during the Battle of Okinawa. Andrew Garfield stars as Doss, with Sam Worthington, Luke Bracey, Teresa Palmer, Hugo Weaving, Rachel Griffiths, and Vince Vaughn in supporting roles.",
    "Ratings": null
  },
  {
    "Id": "10",
    "Star": "Macaulay Culkin, Joe Pesci, Daniel Stern",
    "img": "https://upload.wikimedia.org/wikipedia/en/7/76/Home_alone_poster.jpg",
    "Url": "https://www.youtube.com/embed/owU3lMxd6jI",
    "Title": "Home Alone",
    "Description": "Home Alone is a 1990 American comedy film written and produced by John Hughes and directed by Chris Columbus. It stars Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, and Catherine O\u0027Hara. The film follows an eight-year-old boy (Culkin), who must defend his home from two burglars (Pesci and Stern) after his family mistakenly leaves him behind on their Christmas vacation.",
    "Ratings": [
      1,
      5,
      3
    ]
  },
  {
    "Id": "11",
    "Star": "Matthew McConaughey, Anne Hathaway, Jessica Chastain",
    "img": "https://upload.wikimedia.org/wikipedia/en/b/bc/Interstellar_film_poster.jpg",
    "Url": "https://www.youtube.com/embed/zSWdZVtXT7E",
    "Title": "Interstellar",
    "Description": "Interstellar is a 2014 epic science fiction film directed, co-written and co-produced by Christopher Nolan. It stars Matthew McConaughey, Anne Hathaway, Jessica Chastain, Bill Irwin, Ellen Burstyn, and Michael Caine. Set in a dystopian future where humanity is struggling to survive, the film follows a group of astronauts who travel through a wormhole near Saturn in search of a new home for humanity.",
    "Ratings": null
  },
  {
    "Id": "12",
    "Star": "James Stewart, Donna Reed, Lionel Barrymore",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/It%27s_a_Wonderful_Life_%281946_poster%29.jpeg/330px-It%27s_a_Wonderful_Life_%281946_poster%29.jpeg",
    "Url": "https://www.youtube.com/embed/ewe4lg8zTYA",
    "Title": "It\u0027s a Wonderful Life",
    "Description": "It\u0027s a Wonderful Life is a 1946 American Christmas fantasy drama film produced and directed by Frank Capra, based on the short story and booklet The Greatest Gift, which Philip Van Doren Stern wrote in 1939 and published privately in 1943.[4] The film is one of the most beloved in American cinema, and has become traditional viewing during the Christmas season.",
    "Ratings": [
      3
    ]
  },
  {
    "Id": "13",
    "Star": "Meryl Streep, Amy Adams, Stanley Tucci",
    "img": "https://upload.wikimedia.org/wikipedia/en/0/00/Julie_and_julia.jpg",
    "Url": "https://www.youtube.com/embed/ozRK7VXQl-k",
    "Title": "Julie and Julia",
    "Description": "Julie \u0026 Julia is a 2009 American comedy-drama film written and directed by Nora Ephron starring Meryl Streep, Amy Adams, Stanley Tucci, and Chris Messina. The film contrasts the life of chef Julia Child in the early years of her culinary career with the life of young New Yorker Julie Powell, who aspires to cook all 524 recipes in Child\u0027s cookbook in 365 days, a challenge she described on her popular blog that made her a published author.",
    "Ratings": null
  },
  {
    "Id": "14",
    "Star": "Bill Murray, Scarlett Johansson",
    "img": "https://upload.wikimedia.org/wikipedia/en/4/4c/Lost_in_Translation_poster.jpg",
    "Url": "https://www.youtube.com/embed/W6iVPCRflQM",
    "Title": "Lost in Translation",
    "Description": "Lost in Translation is a 2003 comedy-drama film written and directed by Sofia Coppola. It stars Bill Murray as aging actor Bob Harris, who befriends college graduate Charlotte (Scarlett Johansson) in a Tokyo hotel. The movie explores themes of loneliness, insomnia, existential ennui, and culture shock against the backdrop of a modern Japanese city.",
    "Ratings": null
  },
  {
    "Id": "15",
    "Star": "Emily Blunt, Lin-Manuel Miranda, Ben Whishaw",
    "img": "https://upload.wikimedia.org/wikipedia/en/4/48/Mary_Poppins_Returns_%282018_film_poster%29.png",
    "Url": "https://www.youtube.com/embed/-3jsfXDZLIY",
    "Title": "Mary Poppins Returns",
    "Description": "Mary Poppins Returns is a 2018 American musical fantasy comedy film directed by Rob Marshall, with a screenplay written by David Magee and a story by Magee, Marshall, and John DeLuca. Based on the book series Mary Poppins by P. L. Travers,[1] the film is a sequel to the 1964 film Mary Poppins, and stars Emily Blunt as Mary Poppins, with Lin-Manuel Miranda, Ben Whishaw, Emily Mortimer, Julie Walters, Dick Van Dyke, Angela Lansbury, Colin Firth, and Meryl Streep in supporting roles. Set in 1930s London, twenty-five years after the events of the original film, the film sees Mary Poppins, the former nanny of Jane and Michael Banks, returning one year after a family tragedy.",
    "Ratings": null
  },
  {
    "Id": "16",
    "Star": "Brad Davis, Randy Quaid",
    "img": "https://upload.wikimedia.org/wikipedia/en/5/52/Original_poster_for_Midnight_Express%2C_1978.jpg",
    "Url": "https://www.youtube.com/embed/lhuutAnXBzQ",
    "Title": "Midnight Express",
    "Description": "Midnight Express is a 1978 prison drama film directed by Alan Parker, produced by David Puttnam and written by Oliver Stone, based on Billy Hayes\u0027 1977 non-fiction book Midnight Express. It stars Brad Davis, Irene Miracle, Bo Hopkins, Paolo Bonacelli, Paul L. Smith, Randy Quaid, Norbert Weisser, Peter Jeffrey and John Hurt.",
    "Ratings": null
  },
  {
    "Id": "17",
    "Star": "Gregory Peck, Audrey Hepburn",
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Roman_Holiday_%281953_poster%29.jpg/330px-Roman_Holiday_%281953_poster%29.jpg",
    "Url": "https://www.youtube.com/embed/9GzCG6lpFUw",
    "Title": "Roman Holiday",
    "Description": "Roman Holiday is a 1953 American romantic comedy film directed and produced by William Wyler. It stars Audrey Hepburn as a royal princess out to see Rome on her own and Gregory Peck as a reporter. Hepburn won an Academy Award for Best Actress for her performance; the screenplay and costume design also won.",
    "Ratings": null
  },
  {
    "Id": "18",
    "Star": "Jackie Chan, Chris Tucker",
    "img": "https://upload.wikimedia.org/wikipedia/en/5/55/Rush_hour_ver2.jpg",
    "Url": "https://www.youtube.com/embed/JMiFsFQcFLE",
    "Title": "Rush Hour",
    "Description": "Rush Hour is a 1998 American action comedy film directed by Brett Ratner and written by Jim Kouf and Ross LaManna from a story by LaManna. It stars Jackie Chan and Chris Tucker as mismatched police officers who must rescue a Chinese diplomat\u0027s kidnapped daughter. Tzi Ma, Tom Wilkinson, Ken Leung, Mark Rolston, Elizabeth Peña and Rex Linn play supporting roles. Released on September 18, 1998, the film grossed over $244 million worldwide. The film\u0027s success led to two sequels: Rush Hour 2 (2001) and Rush Hour 3 (2007).",
    "Ratings": null
  },
  {
    "Id": "19",
    "Star": "Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen",
    "img": "https://upload.wikimedia.org/wikipedia/en/b/be/The_Lord_of_the_Rings_-_The_Return_of_the_King_%282003%29.jpg",
    "Url": "https://www.youtube.com/embed/r5X-hFf6Bwo",
    "Title": "The Lord of the Rings: The Return of the King",
    "Description": "The Lord of the Rings: The Return of the King is a 2003 epic fantasy adventure film directed by Peter Jackson, based on the third volume of Tolkien\u0027s The Lord of the Rings. The film is the third instalment in The Lord of the Rings trilogy and was produced by Barrie M. Osborne, Jackson and Fran Walsh, and written by Walsh, Philippa Boyens and Jackson. The film features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, and Sean Bean. It was preceded by The Fellowship of the Ring (2001) and The Two Towers (2002).",
    "Ratings": null
  },
  {
    "Id": "20",
    "Star": "Julie Andrews, Christopher Plummer",
    "img": "https://upload.wikimedia.org/wikipedia/en/c/c6/Sound_of_music.jpg",
    "Url": "https://www.youtube.com/embed/UY6uw3WpPzY",
    "Title": "The Sound of Music",
    "Description": "The Sound of Music is a musical with music by Richard Rodgers, lyrics by Oscar Hammerstein II, and a book by Howard Lindsay and Russel Crouse. It is based on the memoir of Maria von Trapp, The Story of the Trapp Family Singers. Set in Austria on the eve of the Anschluss in 1938, the musical tells the story of Maria, who takes a job as governess to a large family while she decides whether to become a nun. She falls in love with the children, and eventually their widowed father, Captain von Trapp. He is ordered to accept a commission in the German navy, but he opposes the Nazis. He and Maria decide on a plan to flee Austria with the children. Many songs from the musical have become standards, such as \u0027Edelweiss\u0027, \u0027My Favorite Things\u0027, \u0027Climb Ev\u0027ry Mountain\u0027, \u0027Do-Re-Mi\u0027, and the title song \u0027The Sound of Music\u0027.",
    "Ratings": null
  },
  {
    "Id": "21",
    "Star": "Tom Hanks, Catherine Zeta-Jones",
    "img": "https://upload.wikimedia.org/wikipedia/en/8/86/Movie_poster_the_terminal.jpg",
    "Url": "https://www.youtube.com/embed/GZjC9dAvWuU",
    "Title": "The Terminal",
    "Description": "The Terminal is a 2004 American comedy-drama film co-produced and directed by Steven Spielberg and starring Tom Hanks, Catherine Zeta-Jones, and Stanley Tucci. The film is about an Eastern European man who becomes stuck in New York\u0027s John F. Kennedy Airport terminal when he is denied entry into the United States and at the same time is unable to return to his native country because of a military coup.",
    "Ratings": null
  },
  {
    "Id": "22",
    "Star": "Leonardo DiCaprio, Kate Winslet",
    "img": "https://upload.wikimedia.org/wikipedia/en/1/19/Titanic_%28Official_Film_Poster%29.png",
    "Url": "https://www.youtube.com/embed/ZQ6klONCq4s",
    "Title": "Titanic",
    "Description": "Titanic is a 1997 American epic romance and disaster film directed, written, co-produced, and co-edited by James Cameron. Incorporating both historical and fictionalized aspects, the film is based on accounts of the sinking of the RMS Titanic, and stars Leonardo DiCaprio and Kate Winslet as members of different social classes who fall in love aboard the ship during its ill-fated maiden voyage.",
    "Ratings": null
  },
  {
    "Id": "23",
    "Star": "Tom Hanks, Tim Allen, Don Rickles",
    "img": "https://upload.wikimedia.org/wikipedia/en/1/13/Toy_Story.jpg",
    "Url": "https://www.youtube.com/embed/rNk1Wi8SvNc",
    "Title": "Toy Story",
    "Description": "Toy Story is a 1995 American computer-animated buddy comedy film produced by Pixar Animation Studios and released by Walt Disney Pictures. The feature film directorial debut of John Lasseter, it was the first entirely computer-animated feature film, as well as the first feature film from Pixar. The screenplay was written by Joss Whedon, Andrew Stanton, Joel Cohen, and Alec Sokolow from a story by Lasseter, Stanton, Pete Docter, and Joe Ranft. The film features music by Randy Newman, and was executive-produced by Steve Jobs and Edwin Catmull. It features the voices of Tom Hanks, Tim Allen, Don Rickles, Wallace Shawn, John Ratzenberger, Jim Varney, Annie Potts, R. Lee Ermey, John Morris, Laurie Metcalf, and Erik von Detten.",
    "Ratings": null
  },
  {
    "Id": "24",
    "Star": "Ryunosuke Kamiki, Mone Kamishiraishi, Ryo Narita",
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0b/Your_Name_poster.png",
    "Url": "https://www.youtube.com/embed/xU47nhruN-Q",
    "Title": "Your Name",
    "Description": "Your Name (Japanese: 君の名は。, Hepburn: Kimi no Na wa) is a 2016 Japanese animated romantic fantasy drama film written and directed by Makoto Shinkai, and produced by CoMix Wave Films. The film was produced by Noritaka Kawaguchi and Genki Kawamura, with music composed by Radwimps. Your Name tells the story of Taki, a high school boy in Tokyo and Mitsuha, a high school girl in a rural town, who suddenly and inexplicably begin to swap bodies. The film stars the voices of Ryunosuke Kamiki, Mone Kamishiraishi, Masami Nagasawa and Etsuko Ichihara. Shinkai\u0027s eponymous novel was published a month before the film\u0027s premiere.",
    "Ratings": null
  }
]